api-server/app/controllers/matches_controller.rb

SELECT `matches`.* FROM `matches`
---
  def index
    puts "Received request."
    @matches = Match.all